/*
  Localizable.strings
  SoulverCore

  Created by Zac Cohan on 29/9/19.
  Copyright © 2019 Zac Cohan. All rights reserved.
*/


/* Line References */
//i.e line1 will be a reference to line 1
"plain text line reference" = "riga";

"line above" = "riga sopra";
"previous line" = "riga precedente";
"prev" = "prec";

///* Inline sub-totals & averages */
//"total" = "totale";
//"sum" = "somma";
//"average" = "media";

/* Unit Categories */
"Time" = "Tempo";
"Acceleration" = "Accelerazione";
"Length" = "Lunghezza";
"Mass" = "Massa";
"Volume" = "Volume";
"Frequency" = "Frequenza";
"Angle" = "Angolo";
"Temperature" = "Temperatura";
"Energy" = "Energia";
"Power" = "Potenza";
"Pressure" = "Pressione";
"Currency" = "Valuta";
"Area" = "Area";
"Speed" = "Velocità";
"Data Transfer" = "Trasferimento dati";
"Data Storage" = "Archiviazione dati";
"Other Unit Kind" = "Altro tipo di unità";

/* Errors */
"Error: ∞" = "Errore: ∞";
"Error: incompatible units" = "Errore: unità incompatibili";
"Error: divide by zero" = "Errore: divisione per zero";
"Error: imaginary number" = "Errore: numero immaginario";
"Error: unsupported multiplicative unit" = "Errore: unità moltiplicativa non supportata";
"Error: unsupported unit in rate" = "Errore: unità non supportata nel tasso";
"Error: division without divisor" = "Errore: divisione senza divisore";
"Error: imprecision due to magnitude" = "Errore: imprecisione dovuta alla grandezza";
"Error: unsupported exponent operation" = "Errore: operazione esponenziale non supportata";

/* Positions of a custom currency symbol */
"Before" = "Prima";
"Before (with space)" = "Prima (con spazio)";
"After" = "Dopo";
"After (with space)" = "Dopo (con spazio)";

/* Answer Contextual Metadata */
/* Used in the contextual menu for an answer */

/* For instance, km, a unit of distance */
"%@, a unit of %@" = "%@, un'unità di %@";

/* a rate, like km per day */
"%@ per %@" = "%@ per %@";
"amount per %@" = "importo per %@";

/* days of the week, like February 12 was a Saturday, March 8 will be a Tuesday */
"%@ was a %@" = "%@ era un %@";
"%@ will be a %@" = "%@ sarà un %@";

/* Quick Operators */
"plusQuickOperator" = "p";
"minusQuickOperator" = "m";
"timesQuickOperator" = "x";
"divideQuickOperator" = "d";

/* Weather Functions */

/* For historical daily weather query: temperature in Sydney _on_ March 12, 2024 */
"on __datestamp" = "il __datestamp";

/* For historical monthly weather query: weather in Sydney _in_ March, 2024 */
"in __datestamp" = "in __datestamp";
